:PROPERTIES:
:ID:       b564b33f-b2f1-4408-855f-738a48daffb6
:END:
#+TITLE: Shipping a webhook receiver
#+LANGUAGE: en
#+PROPERTY: header-args:bash :tangle no :dir (expand-file-name ".." default-directory) :results verbatim :cache yes

I want to build a webhook receiver that listens for GitHub events and
triggers deployments. It's a small Flask app — a single file with a
few routes. I need to package it in a container, and I don't want to
write the venv setup from scratch every time I start a new
microservice like this.

* Getting a ready-made Flask environment

  The =flask-venv= target gives me a complete virtualenv with Flask
  already installed, exported as a directory artifact. I can verify
  that the =flask= command is available:

  #+NAME: flask_venv_export
  #+begin_src fixtureyaml
func: flask-venv
chain:
  - export: $TMP/out
post: test -f "$TMP/out/bin/flask" && echo "bin/flask exists"
  #+end_src

  #+RESULTS[ab67d2103650dc548cde34da2ee680ec70de10e3]: flask_venv_export
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call flask-venv export --path="$TMP/out" > /dev/null
  test -f "$TMP/out/bin/flask" && echo "bin/flask exists"
  #+end_src

  #+RESULTS[c20166dfff494f2f51a5f807ea6742b2388848b2]:
  : bin/flask exists
  :end:

* Adding gunicorn for production

  In production, I don't use the Flask dev server — I need =gunicorn=
  as the WSGI server. I can add it to the same venv:

  #+NAME: flask_with_gunicorn
  #+begin_src fixtureyaml
func: flask-venv
args:
  pip-packages: [gunicorn]
chain:
  - export: $TMP/out2
post: test -f "$TMP/out2/bin/gunicorn" && echo "bin/gunicorn exists"
  #+end_src

  #+RESULTS[1d8797e787a42b14526dec276a68d238c6e567a9]: flask_with_gunicorn
  :results:
  #+begin_src bash :exports code :eval no-export
  dagger call flask-venv --pip-packages=gunicorn export --path="$TMP/out2" > /dev/null
  test -f "$TMP/out2/bin/gunicorn" && echo "bin/gunicorn exists"
  #+end_src

  #+RESULTS[da002d4a369cb1fe7c2405f3113139ef3370cc76]:
  : bin/gunicorn exists
  :end:
